{"coreState":"Draft","currentPage":"Main","label":"Active-Gracie Barra Waiver","values":{"Status":"Active","Type":"Gracie Barra Waiver","Terms Information":"<h4><strong>Release and Waiver of Liability and Indemnity Agreement</strong></h4><div><br></div><div>In consideration of being permitted to participate in any way in the Martial Arts Program either being by way of an online virtual platform or as indicated below and/or being permitted to enter for any purpose any restricted area (here in defined as any area where in admittance to the general public is prohibited), the parent(s) and/or legal guardian(s) of the minor participant named below agree:</div><ol><li>The parent(s) and/or legal guardian(s) will instruct the minor participant that prior to participating in the below martial arts activity or event, he or she should inspect the facilities and equipment to be used, and if he or she believes anything is unsafe, the participant should immediately advise the officials of such condition and refuse to participate. I understand and agreed that, if at any time, I feel anything to be UNSAFE, I will immediately take all precautions to avoid the unsafe area and REFUSE TO PARTICIPATE further.</li><li>I/WE fully understand and acknowledge that: (a) There are risks and dangers associated with participation in martial arts events and activities which could result in bodily injury partial and/or total disability, paralysis and death. (b) The social and economic losses and/or damages, which could result from these risks and dangers described above, could be severe. (c) These risks and dangers may be caused by the action, inaction or negligence of the participant or the action, inaction or negligence of others, including, but not limited to, the Releasees named below. (d) There may be other risks not known to us or are not reasonably foreseeable at this time.</li><li>I/WE accept and assume such risks and responsibility for the losses and/or damages following such injury, disability, paralysis or death, however caused and whether caused in whole or in part by the negligence of the Releasees named below including that at this time some human contact in the same location carries with it certain inherent risks that cannot be eliminated regardless of the care taken to avoid COVID-19 transmission. I understand and appreciate these and other risks are inherent in the activity I am participating in. I hereby assert that my participation is voluntary and that I knowingly assume all such risks and while aware of these risks I have elected to be present at the facility or to undertake online virtual training and participate in such training.</li><li>I/WE HEREBY RELEASE, WAIVE, DISCHARGE AND COVENANT NOT TO SUE , the martial arts facility used by the participant, including its owners, managers, promoters, lessees of premises used to conduct the martial arts event or program, premises and event inspectors, underwriters, consultants and others who give recommendations, directions, or instructions to engage in risk evaluation or loss control activities regarding the martial arts facility or events held at such facility and any online virtual training undertaken and each of them, their directors, officers, agents, employees, all for the purposes herein referred to as “Releasee”...FROM ALL LIABILITY TO THE UNDERSIGNED, my/our personal representatives, assigns, executors, heirs and next to kin FOR ANY AND ALL CLAIMS, DEMANDS, LOSSES OR DAMAGES AND ANY CLAIMS OR DEMANDS THEREFORE ON ACCOUNT OF ANY INJURY, INCLUDING BUT NOT LIMITED TO THE DEATH OF THE PARTICIPANT OR DAMAGE TO PROPERTY, ARISING OUT OF OR RELATING TO THE EVENT(S) CAUSED OR ALLEGED TO BE CAUSED IN WHOLE OR IN PART BY THE NEGLIGENCE OF THE RELEASEE OR OTHERWISE including all potential claims related to or resulting in personal injury or illnesses (including death) and property loss arising from any COVID-19 transmission that results from the undersigned being present at the facility and/or participating in the training online or otherwise.</li><li>I/WE HEREBY acknowledge that THE ACTIVITIES OF THE EVENT(S) ARE VERY DANGEROUS and involve the risk of serious injury and/or death and/or property damage. Each of THE UNDERSIGNED also expressly acknowledges that INJURIES RECEIVED MAY BE COMPOUNDED OR INCREASED BY NEGLIGENT RESCUE OPERATIONS OR PROCEDURES OF THE RELEASEES. I attest that I have not tested positive for COVID-19 or if I have previously tested positive for COVID-19 I have been cleared by a medical professional that I no longer carry COVID-19. Additionally, I do not have any symptoms consistent with COVID-19 and I have not had any recent contact with anyone who has COVID-19.</li><li>I/We also agree to indemnity and hold harmless Gracie Barra and any of its affiliates, its directors, officers, employees and agents from any and all claims, actions, suits, costs, expenses, damages and liabilities including attorney fees resulting from any COVID-19 transmission that occurs from being present at the facility or training outside the facility using the virtual platforms and participating in the training.</li><li>EACH OF THE UNDERSIGNED further expressly agrees that the foregoing release, waiver, and indemnity agreement is intended to be as broad and inclusive as is permitted by the law of the Province or State in which the event is conducted and that if any portion is held invalid, it is agreed that the balance shall, notwithstanding continue in full legal force and effect.</li><li>On behalf of the participant and individually, the undersigned partner(s) and/or legal guardian(s) for the minor participant executes this Waiver and Release. If, despite this release, the participant makes a claim against any of the Releasees, the parent(s) and/or legal guardian(s) will reimburse the Releasee for any money which they have paid to the participant, or on his behalf, and hold them harmless.</li></ol><div><br></div><div><u>PRIVACY &amp; DATA USE ACKNOWLEDGEMENT</u></div><div>By signing this agreement, you acknowledge that your personal data (including your name, email, and phone number) may be used by Gracie Barra - $school_legal_name$ and shared with affiliated Gracie Barra entities operating under the Gracie Barra brand (such as GB Wear, GB Institute, and GB Online) to support your training experience, deliver relevant updates, and offer program benefits. Your information will not be sold to third parties, and you may request to update or opt out of communications at any time by contacting Gracie Barra ‐ $school_legal_name$.</div><div><br></div><div><strong>I HAVE READ THIS RELEASE AND WAIVER OF LIABILITY, ASSUMPTION OF RISK AND INDEMNITY AGREEMENT, FULLY UNDERSTAND ITS TERMS, UNDERSTAND THAT I HAVE GIVEN UP SUBSTANTIAL RIGHTS BY SIGNING IT, AND HAVE SIGNED IT FREELY AND VOLUNTARILY WITHOUT ANY INDUCEMENT, ASSURANCE, OR GUARANTEE BEING MADE TO ME AND INTEND MY SIGNATURE TO BE COMPLETE AND UNCONDITIONAL RELEASE OF ALL LIABILITY TO THE GREATEST EXTENT ALLOWED BY LAW.</strong></div>"}}
{"coreState":"Submitted","currentPage":"Main","label":"Active-Stripe Member Registration","values":{"Status":"Active","Type":"Stripe Member Registration","Terms Information":"<div><u>BILLING INFORMATION</u></div><div><strong>LATE PAYMENT FEES AND RETURNED CHECKS:</strong> A late fee of $20 will be applied for any payments that are more than five (5) days late. A charge of $25 will be made for any checks returned due to insufficient funds. It is your responsibility to inform Gracie Barra - $school_name$ of any changes in your billing/payment information PRIOR to the date your membership fee is charged. If you don’t notify us and the payment is declined and not paid within the 5 day grace period, you will be charged a late fee automatically.</div><div>By signing this agreement, I authorize Gracie Barra ‐ $school_name$ to bill my credit card to collect my $payment_period$ membership fee as stated in this contract.</div><div><br></div><div><u>COOLING OFF PERIOD</u></div><div>\"You, the student, may cancel this agreement at any time prior to the midnight of the fifth business day of the Gracie Barra Gym after the date of this agreement, excluding Sundays and holidays. To cancel this agreement, mail or deliver a signed and dated notice, or send a telegram which states that you, the student, are canceling this agreement, or words of similar effect. The notice shall be sent to Gracie Barra Membership Department at Gracie Barra - $school_name$ $school_address$</div><div><br></div><div><u>BILLING</u> Membership Fee will be collected $payment_period$ starting on $start_date$ and will continue to be collected $payment_period$, <strong>REGARDLESS OF THE USE OF YOUR MEMBERSHIP.</strong></div><div><br></div><div><u>MEMBERSHIP POLICIES</u></div><div><strong><em>$payment_period$:</em></strong> The membership fee will be collected, non‐stop, on a $payment_period$ basis until receive a <strong>60 days cancelation notice</strong>.</div><div><strong><em>MEMBERSHIP FREEZE:</em></strong></div><div>You may freeze your account. To do so, you must send Gracie Barra ‐ $school_name$ a written notice requesting the freeze. Your membership will be frozen immediately and during the period, your credit card on file will be billed <strong>$frozen_charge$ $payment_period$</strong>, on the date agreed upon in your original membership agreement, in place of the full tuition amount until the freeze period ends.</div><div><strong><em>MEMBERSHIP CANCELLATION:</em></strong></div><div><strong>You have the right to cancel your membership with a 60 days notice, for any reason.</strong></div><div><strong> You have the right to cancel your membership with a 30 days notice if you:</strong></div><div><strong>a.)</strong> Have a change of physical address, being that your new address is more than 25 miles from this school and there are no other GB schools in a 25-mile radius of the new address (requires proper documentation proof: Utility Bill, Mortgage/Rent Receipt, etc.)</div><div><strong>b.)</strong> Have a permanent medical condition or injury that prevents you from further participating in classes and training currently AND in the future (requires proper documentation from DOCTOR.) If the medical condition or injury you have been diagnosed with is preventative of allowing you to participate temporarily, this option is not applicable and you may freeze your membership as detailed above.</div><div><strong>c.)</strong> Deployment. (requires proper documentation)</div><div><strong>Kids.) You have the right to cancel your membership FOR ANY REASON WITH A FEE EQUAL TO SIXTY (60) DAYS OF YOUR TUITION.</strong></div><div>Your cancellation request must be in the method of a written notice and acknowledged by Gracie Barra - $school_name$. Your membership cancellation will not be processed until the cancellation fee amount is collected in full AND Gracie Barra - $school_name$ has received and confirmed your written notice, unless these two items have been received your account will continue to be billed $payment_period$.</div><div><br></div><div><u>FACILITIES</u></div><div>Gracie Barra ‐ $school_name$ reserves the right to alter the days, hours of operation and classes if deemed necessary to better fit the student’s needs. You are welcome to use any Gracie Barra Facility “Jiu Jitsu Programs” according with our visitor student policy, without any extra fee. Please check www.graciebarra.com/gb‐jiu‐jitsu‐ world‐map, “find a school link”, for their hours of operation. Class schedules vary from location to location.</div><div>This agreement is subject to a 4% increase annually.</div><div><br></div><div><strong>ALL DELINQUENT PAYMENTS AND FEES MUST BE PAID PRIOR TO A MEMBERSHIP FREEZE OR CANCELLATION OF ANY KIND CAN BE APPROVED.</strong></div><div><br></div><div><u>PERMISSION TO USE PHOTOGRAPHY</u></div><div>I grant to Gracie Barra, its representatives, and employees the right to take photographs of me and my property in connection with the above‐identified membership. I authorize Gracie Barra, its assigns and transferees to copyright, use and publish the same in print and/or electronically. I agree that Gracie Barra may use such photographs of me with or without my name and for any lawful purpose, including for example such purposes as publicity, illustration, advertising, and Web content.</div><div><br></div><div><u>RELEASE FROM LIABILITY AND INDEMNIFICATION (READ BEFORE SIGN)</u></div><div>As a member, guest, or participant at Gracie Barra ‐ $school_legal_name$, I understand and recognize that Jiu‐Jitsu is a physically demanding activity and a sport that involves physical contact and risk of physical injury. You as a member, guest, or participant hereby agree to assume the risk of injury in its regardless of the cause. As a condition of your membership and or participation, you also must agree that in the event any claim for personal injury or property damage is prosecuted against Gracie Barra Gracie Barra ‐ $school_legal_name$, its agents and employees, the member and or participant shall indemnify and hold harmless Gracie Barra ‐ $school_legal_name$, its agents, and employees from any and all such claims and causes of action.</div><div><br></div><div>I, for myself, my heirs, successors, executors hereby KNOWINGLY AND INTENTIONALLY WAIVE AND RELEASE, INDEMNIFY AND HOLD HARMLESS GRACIE BARRA Gracie Barra ‐ $school_legal_name$, its owners, agents, and employees, from and against any and all claims, actions, causes of action, liabilities, suits, expenses (including reasonable attorney’s fees) and NEGLIGENCE of any kind or nature, whether foreseen or in the physical activities and self‐ defense training, whether such damages, loss, injury, paralysis or death results from NEGLIGENCE of Gracie Barra ‐ $school_legal_name$, or its agents, employees, or from some other cause. I agree that neither I, nor anyone act on my behalf, will make a claim, sue or otherwise maintain legal action of any kind against Gracie Barra ‐ $school_legal_name$ as a result of any injury, paralysis or death to me as a member, guest or participant.</div><div><br></div><div>In consideration of Gracie Barra ‐ $school_name$ allowing the undersigned to participate in training at the above referenced facility, I for myself, my heirs, personal representative or assigns, do hereby release, waive, discharge, and covenant not to sue Gracie Barra, it’s directors, officers, employees and agents from liability from any and all potential claims related to or resulting in personal injury or illnesses (including death) and property loss arising from any COVID-19 transmission that results from the undersigned being present at the facility and participating in the training.</div><div><br></div><div>Assumption of Risk:</div><div>At this time some human contact or confinement in the same location carries with it certain inherent risks that cannot be eliminated regardless of the care taken to avoid COVID-19 Transmission. I have read the previous paragraph and I know and understand and appreciate these and other risks are inherent in the activity I am participating in. I hereby assert that my participation is voluntary and that I knowingly assume all such risks and while aware of these risks I have elected to be present at the facility and participate in training.</div><div><br></div><div>Indemnification and Hold Harmless:</div><div>I also agree to indemnify and hold harmless Gracie Barra, its directors, officers, employees and agents from any and all claims, actions, suits, costs, expenses, damages and liabilities including attorney fees resulting from any COVID-19 transmission that occurs from to being present at the facility and participating in the training.</div><div><br></div><div>Severability:</div><div>The undersigned further expressly agrees that the foregoing waiver and assumption of risk agreement is intended to be as broad and inclusive as is permitted by the law of the State of Arizona and that if any portion thereof is held invalid, it is agreed that the balance shall, notwithstanding, continue in full legal force and effect.</div><div><br></div><div>Acknowledgment of Understanding:</div><div>I have read this waiver of liability, assumption of risk, and indemnity agreement, and fully understand its terms. I acknowledge that I am signing the agreement freely and voluntarily and intend by my signature to be a complete and unconditional release of all liability to the greatest extent allowed by law. I attest that I have not tested positive for COVID-19 or If I have previously tested positive for COVID-19 I have been cleared by a medical professional that I no longer carry COVID-19. Additionally, I do not have any symptoms consistent with COVID-19 and I have not had any recent contact with anyone who has COVID-19.</div><div><br></div><div>I HAVE READ THIS AGREEMENT, FULLY UNDERSTAND ITS TERMS, UNDERSTAND THAT I HAVE GIVEN UP SUBSTANTIAL RIGHTS BY SIGNING IT AND HAVE SIGNED IT FREELY AND WITHOUT ANY INDUCEMENT OR ASSURANCE OF ANY NATURE AND INTEND IT TO BE A COMPLETE AND UNCONDITIONAL RELEASE OF ALL LIABILITY TO THE GREATEST EXTENT ALLOWED BY LAW AND AGREE THAT IF ANY PORTION OF THIS AGREEMENT IS HELD TO BE INVALID THAT THE BALANCE, NOTWITHSTANDING, SHALL CONTINUE IN FULL FORCE AND EFFECT.</div><div><br></div><div>I hereby am purchasing a membership at Gracie Barra ‐ $school_name$, independently owned/ operated by Gracie Barra ‐ $school_legal_name$ By signing this agreement I acknowledge receipt of a fully completed copy of this agreement executed by both Gracie Barra ‐ $school_name$ and myself and acknowledge and agree to the agreement terms.</div><div><br></div><div>If Minor:</div><div>The undersigned parent and or legal guardian affirm that I am freely signing this agreement.</div>"}}
